EDT/УТ/src/Catalogs/новаНачисленияУдержания/новаНачисленияУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаНачисленияУдержания</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Удержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.новаСтатьиДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>База</name>
    <type>
      <types>EnumRef.новаВидыБазНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитываемое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.новаПоказателиРасчетаНачислений</types>
      </type>
    </attributes>
    <attributes>
      <name>Псевдоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/новаЗначенияПоказателейРасчетаНачислений/новаЗначенияПоказателейРасчетаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаЗначенияПоказателейРасчетаНачислений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.новаПоказателиРасчетаНачислений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/новаНачисленияУдержания/ObjectModule.bsl
// Рейс, для которого рассчитывается значение начисления.
Перем Рейс Экспорт; // <БизнесПроцессСсылка.новаРейсМестнойДоставки>

// Местная доставка, для которой рассчитывается значение начисления.
Перем ЗаданиеРейса Экспорт; // <БизнесПроцессСсылка.новаМестнаяДоставка>

// Установленные категории местной доставки, для которых рассчитывается значение начисления.
Перем КатегорииЗадания Экспорт; // <Соответствие(<СправочникСсылка.новаКатегорииГрузов>)>

// Дата, на которую рассчитывается начисление.
Перем ДатаРасчета Экспорт; // <Дата>

Перем мсЗначенияПоказателей;
Перем МакросРасчета;

// Подготавливает расчет начисления. Вызывается один раз при создании объекта.
//
Процедура ПодготовитьКРасчету() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ЗначенияПоказателей.Значение, 0) КАК Значение,
	|	Показатели.Псевдоним КАК Псевдоним
	|ИЗ
	|	Справочник.новаНачисленияУдержания.Показатели КАК Показатели
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.новаЗначенияПоказателейРасчетаНачислений.СрезПоследних(&ДатаРасчета, Показатель В (&Показатели)) КАК ЗначенияПоказателей
	|ПО
	|	ЗначенияПоказателей.Показатель = Показатели.Показатель
	|
	|ГДЕ
	|	Показатели.Ссылка = &Начисление";
	
	Запрос.УстановитьПараметр("ДатаРасчета", КонецДня(ДатаРасчета));
	Запрос.УстановитьПараметр("Начисление", Ссылка);
	Запрос.УстановитьПараметр("Показатели", Показатели.ВыгрузитьКолонку("Показатель"));
	
	тзЗначенияПоказателей = Запрос.Выполнить().Выгрузить();
	
	мсЗначенияПоказателей = Новый Массив;
	МакросРасчета = ФормулаРасчета;
	Для Каждого стрПоказатель Из тзЗначенияПоказателей Цикл
		мсЗначенияПоказателей.Добавить(стрПоказатель.Значение);
		
		Псевдоним = СокрЛП(стрПоказатель.Псевдоним);
		Если Псевдоним = "" Тогда Продолжить; КонецЕсли;
		
		МакросРасчета = СтрЗаменить(МакросРасчета, Псевдоним, "мсЗначенияПоказателей[" + СтрЗаменить(Строка(тзЗначенияПоказателей.Индекс(стрПоказатель)), Символы.НПП, "") + "]");
	КонецЦикла;
КонецПроцедуры

// Вычисляет значение начисления по заданным параметрам.
//
// Возвращаемое значение:
//  <Число>
//
Функция Рассчитать() Экспорт
	Результат = 0;
	Выполнить(МакросРасчета);
	Возврат Результат;
КонецФункции

КатегорииЗадания = Новый Соответствие;
